Revit 2018 API
ShapeImporter Constructor
 Default constructor. Initializes an instance of ShapeImporter that will automaticall?y recognize the file format from its extension (ShapeImporterSourceFormat.Auto).
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 18.0.0.0 (18.0.0.0)
Since: 2017
Syntax
C#
public ShapeImporter()
Visual Basic
Public Sub New
Visual C++
public:
ShapeImporter()
See Also
ShapeImporter Class
Autodesk.Revit.DB Namespace